{"class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_2", 0, 0], ["input_1", 0, 0]], "layers": [{"name": "input_2", "config": {"batch_input_shape": [null, 5, 80, 80], "name": "input_2", "sparse": false, "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "sequential_1", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "padding": "same", "kernel_size": [8, 8], "filters": 32, "dtype": "float32", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_1", "activation": "relu", "strides": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "batch_input_shape": [null, 5, 80, 80], "bias_constraint": null, "trainable": true, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "kernel_size": [4, 4], "filters": 64, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_2", "activation": "relu", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "kernel_size": [4, 4], "filters": 64, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_3", "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "activation": "relu", "bias_constraint": null, "trainable": true, "activity_regularizer": null, "units": 128}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "activation": "relu", "bias_constraint": null, "trainable": true, "activity_regularizer": null, "units": 128}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_3", "activation": "linear", "bias_constraint": null, "trainable": true, "activity_regularizer": null, "units": 3}}], "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Sequential"}, {"name": "input_1", "config": {"batch_input_shape": [null, 3], "name": "input_1", "sparse": false, "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "dot_1", "config": {"name": "dot_1", "axes": [1, 1], "trainable": true, "normalize": false}, "inbound_nodes": [[["sequential_1", 1, 0, {}], ["input_1", 0, 0, {}]]], "class_name": "Dot"}], "output_layers": [["dot_1", 0, 0]]}, "backend": "theano", "keras_version": "2.0.1"}