{"class_name": "Model", "config": {"name": "model_1", "output_layers": [["merge_1", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 5, 80, 80], "input_dtype": "float32", "name": "input_2"}, "name": "input_2"}, {"class_name": "Sequential", "inbound_nodes": [[["input_2", 0, 0]]], "config": [{"class_name": "Convolution2D", "config": {"bias": true, "b_constraint": null, "input_dtype": "float32", "W_regularizer": null, "dim_ordering": "th", "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "b_regularizer": null, "nb_col": 8, "border_mode": "same", "nb_filter": 32, "nb_row": 8, "trainable": true, "subsample": [4, 4], "W_constraint": null, "batch_input_shape": [null, 5, 80, 80], "name": "convolution2d_1"}}, {"class_name": "Convolution2D", "config": {"bias": true, "b_constraint": null, "W_regularizer": null, "dim_ordering": "th", "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "activity_regularizer": null, "nb_col": 4, "border_mode": "same", "nb_filter": 64, "nb_row": 4, "trainable": true, "subsample": [2, 2], "W_constraint": null, "name": "convolution2d_2"}}, {"class_name": "Convolution2D", "config": {"bias": true, "b_constraint": null, "W_regularizer": null, "dim_ordering": "th", "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "activity_regularizer": null, "nb_col": 4, "border_mode": "same", "nb_filter": 64, "nb_row": 4, "trainable": true, "subsample": [1, 1], "W_constraint": null, "name": "convolution2d_3"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "strides": [2, 2], "dim_ordering": "th", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "b_constraint": null, "W_regularizer": null, "output_dim": 128, "activation": "relu", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dim": null, "trainable": true, "name": "dense_1", "W_constraint": null}}, {"class_name": "Dense", "config": {"bias": true, "b_constraint": null, "W_regularizer": null, "output_dim": 128, "activation": "relu", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dim": null, "trainable": true, "name": "dense_2", "W_constraint": null}}, {"class_name": "Dense", "config": {"bias": true, "b_constraint": null, "W_regularizer": null, "output_dim": 3, "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dim": null, "trainable": true, "name": "dense_3", "W_constraint": null}}], "name": "sequential_1"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 3], "input_dtype": "float32", "name": "input_1"}, "name": "input_1"}, {"class_name": "Merge", "inbound_nodes": [[["sequential_1", 1, 0], ["input_1", 0, 0]]], "config": {"mode_type": "raw", "output_shape": null, "concat_axis": -1, "output_shape_type": "raw", "mode": "dot", "dot_axes": [1, 1], "name": "merge_1"}, "name": "merge_1"}], "input_layers": [["input_2", 0, 0], ["input_1", 0, 0]]}, "keras_version": "1.0.8"}